'use strict'
// 3) очередь
// обьект
// свойства
// -продукты
// - люди
// -текущая очередь
// - очередь,что прошла
// созадть программу которая имитирует очередь(при вызове функции передаем параметр, ка кдолго будет работать функция)
// - человек становиться в очередь(2 человека  с одинаковым именем не могут стоять в очереди)
// что такое очередь- первый пришел, первый ушел
// - когда человек условно(возле кассы) у него уходит на покупку от 1до 3 секунд
// - он покупает продукты(может 1 , а может несколько)
// -по окончанию функции выводиться список покупателей(продукты которые они покупали и количество, и сумму потраченную на покупки)
function Queue(productsCount, people){


}
let arrName = ["Аввакум","Аваз","Агап","Агафон","Август","Августин","Аггей","Авраам","Абрам","Аарон","Автандил","Авдей","Авдей","Азарий","Арам","Аркадий","Арий","Аристарх","Арно","Арон","Арнольд","Арсен, Арсений","Архип","Артур","Артем","Артемий","Акакий","Алан","Ален","Аким","Альберт","Альфред","Александр","Алексей","Амвросий","Анатолий","Амадей","Амадеус","Амаяк","Анисим","Апполинарий","Антон","Ануфрий","Ануфрий","Андрей","Аскольд","Афанасий","Ахмет","Адам","Адриан","Адольф","Ашот"];
let arrSurname = ["Шевченок","Уточка","Подушкин","Илюшин"],
function QueueSimulate(){}
